# Aula 03 - Series & DataFrames
---

<img src="https://lc-public-assets.s3.sa-east-1.amazonaws.com/images/Logos/logoLcPng.webp" width="220px" style="position: absolute; top: 15px; right: 20px; border-radius: 5px;" />

In [1]:
import numpy as np
import pandas as pd

#### Questão 03

Crie um array com 40 elementos entre 0 e π.

In [5]:
questao3 = np.linspace(0, np.pi, 40)

#### Questão 04

Crie um array com 40 elementos, todos iguais a 6.

In [6]:
questao4 = np.full(40, 6)

#### Questão 05

Divida o array obtido na Questão 4 por 3 e, em seguida, multiplique-o pelo array obtido na Questão 3.

In [9]:
(questao4 / 3) * questao3

array([0.        , 0.16110732, 0.32221463, 0.48332195, 0.64442926,
       0.80553658, 0.96664389, 1.12775121, 1.28885852, 1.44996584,
       1.61107316, 1.77218047, 1.93328779, 2.0943951 , 2.25550242,
       2.41660973, 2.57771705, 2.73882436, 2.89993168, 3.061039  ,
       3.22214631, 3.38325363, 3.54436094, 3.70546826, 3.86657557,
       4.02768289, 4.1887902 , 4.34989752, 4.51100484, 4.67211215,
       4.83321947, 4.99432678, 5.1554341 , 5.31654141, 5.47764873,
       5.63875604, 5.79986336, 5.96097068, 6.12207799, 6.28318531])

## Series - Continuação...

In [10]:
serie2 = pd.Series(data=[2320, 5430, 8300, 4560, 3768], index=['seg', 'ter', 'qua', 'qui', 'sex'])

In [20]:
(serie2 + serie2['seg':'qua']).sort_index()

qua    16600.0
qui        NaN
seg     4640.0
sex        NaN
ter    10860.0
dtype: float64

#### Funções mais completas para realizar operações aritméticas entre `Series`

- `add`
- `subtract`
- `multiply`
- `divide`

In [23]:
serie2.add(serie2['seg':'qua'], fill_value=0)

qua    16600.0
qui     4560.0
seg     4640.0
sex     3768.0
ter    10860.0
dtype: float64

### Indexação e Slices

In [14]:
serie2

seg    2320
ter    5430
qua    8300
qui    4560
sex    3768
dtype: int64

In [12]:
serie2[0]

2320

In [15]:
serie2['seg']

2320

In [16]:
serie2[0:3]

seg    2320
ter    5430
qua    8300
dtype: int64

In [17]:
serie2['seg':'qua']

seg    2320
ter    5430
qua    8300
dtype: int64

In [19]:
serie2['qui':'ter':-1]

qui    4560
qua    8300
ter    5430
dtype: int64

### Máscaras

In [24]:
serie2

seg    2320
ter    5430
qua    8300
qui    4560
sex    3768
dtype: int64

In [25]:
serie2 > 5000

seg    False
ter     True
qua     True
qui    False
sex    False
dtype: bool

In [26]:
serie2[serie2 > 5000]

ter    5430
qua    8300
dtype: int64

In [27]:
serie2[(serie2 > 3000) & (serie2 < 6000)]

ter    5430
qui    4560
sex    3768
dtype: int64

## DataFrames
---

- [Criação de DataFrames]()
- Acesso aos dados
    
- Criando novas colunas
- `reset_index` e `set_index`
- Carregando e Salvando Datasets
    - Conhecendo o [Kaggle](https://www.kaggle.com/)
    - CSV
    - XLSX
    - HTML  
    - ...

### Criação de DataFrames

<div style="display: block; margin: 2rem 0; background-color: #1E90FF33; border: 2px solid #1E90FF; border-radius: 7px; padding: 20px; width: 50%">
    <a style="text-align: center; display: block; width: 100%; font-size: 1.2rem" href="https://www.walissonsilva.com/posts/diferentes-formas-de-criar-um-dataframe">Diferentes formas de criar um DataFrame</a>
<div>

### 1. Array bidimensional

In [29]:
dados = np.random.randint(1, 100, (4, 4))

In [30]:
dados

array([[51, 64, 83,  9],
       [ 7, 83, 13, 31],
       [94, 31, 45, 47],
       [85, 18, 76,  2]])

In [32]:
pd.DataFrame(data=dados, columns=['Coluna 1', 'Coluna 2', 'Coluna 3', 'Coluna 4'])

   Coluna 1  Coluna 2  Coluna 3  Coluna 4
0        51        64        83         9
1         7        83        13        31
2        94        31        45        47
3        85        18        76         2

In [34]:
matriz = np.array([[72, 180, 26], [80, 170, 19], [60, 165, 15]])
matriz

array([[ 72, 180,  26],
       [ 80, 170,  19],
       [ 60, 165,  15]])

In [37]:
pd.DataFrame(data=matriz, columns=['Peso', 'Altura', 'Idade'], index=['João', 'Felipe', 'Patrícia'])

          Peso  Altura  Idade
João        72     180     26
Felipe      80     170     19
Patrícia    60     165     15

In [38]:
pd.DataFrame(data=matriz, columns=['Peso', 'Altura', 'Idade'])

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### 2. Dicionários de Listas

In [40]:
dl = {
    'Peso': [72, 80, 60],
    'Altura': [180, 170, 165],
    'Idade': [26, 19, 15]
}

In [41]:
pd.DataFrame(dl)

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### 3. Lista de dicionários

In [47]:
ld = [
    {
        'Peso': 72,
        'Altura': 180,
        'Idade': 26
    },
    {
        'Peso': 80,
        'Altura': 170,
        'Idade': 19
    },
    {
        'Peso': 60,
        'Altura': 165,
        'Idade': 15
    }
]

In [48]:
pd.DataFrame(ld)

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### Acessando os elementos

- Acessando coluna(s)
- Acessando um elemento específico
- Acessando linha(s)
- `loc` e `iloc`

In [49]:
dl = {
    'Peso': [72, 80, 60],
    'Altura': [180, 170, 165],
    'Idade': [26, 19, 15]
}

df = pd.DataFrame(dl)

In [50]:
df

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

In [51]:
df['Peso']

0    72
1    80
2    60
Name: Peso, dtype: int64

In [52]:
df['Altura']

0    180
1    170
2    165
Name: Altura, dtype: int64

In [53]:
df.loc[0]

Peso       72
Altura    180
Idade      26
Name: 0, dtype: int64

In [56]:
df['Altura'][0]

180

In [58]:
df.loc[0]['Peso']

72

In [60]:
df

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

In [61]:
df.iloc[0, 1]

180

### Criando novas colunas

In [62]:
df

   Peso  Altura  Idade
0    72     180     26
1    80     170     19
2    60     165     15

### IMC

$$
IMC = \frac{Peso}{Altura^2}
$$

In [64]:
df['Peso'] / (df['Altura'] / 100)**2

0    22.222222
1    27.681661
2    22.038567
dtype: float64

In [65]:
df['IMC'] = df['Peso'] / (df['Altura'] / 100)**2

In [66]:
df

   Peso  Altura  Idade        IMC
0    72     180     26  22.222222
1    80     170     19  27.681661
2    60     165     15  22.038567

### Removendo Linhas/Colunas

In [70]:
df = df.drop(1)

In [71]:
df

   Peso  Altura  Idade        IMC
0    72     180     26  22.222222
2    60     165     15  22.038567

In [78]:
df.drop('Idade', axis=1, inplace=True)

In [79]:
df

   Peso  Altura        IMC
0    72     180  22.222222
2    60     165  22.038567

### `reset_index` e `set_index`

In [80]:
df

   Peso  Altura        IMC
0    72     180  22.222222
2    60     165  22.038567

In [83]:
df['Nome'] = ['João', 'Maria']

In [84]:
df

   Peso  Altura        IMC   Nome
0    72     180  22.222222   João
2    60     165  22.038567  Maria

In [87]:
df.set_index('Nome', inplace=True)

In [88]:
df

       Peso  Altura        IMC
Nome
João     72     180  22.222222
Maria    60     165  22.038567

In [90]:
df.reset_index(inplace=True)

In [91]:
df

    Nome  Peso  Altura        IMC
0   João    72     180  22.222222
1  Maria    60     165  22.038567

### Carregando e Salvando DataFrames

In [95]:
df = pd.read_csv('../datasets/aluguel.csv', sep=';')

In [96]:
df

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
...,...,...,...,...,...,...,...,...,...,...,...
19826,Quitinete,Glória,1,0,0,10,400.0,107.0,10.0,40.00,Apartamento
19827,Quitinete,Flamengo,1,0,0,23,900.0,605.0,0.0,39.13,Apartamento
19828,Quitinete,Centro,1,0,0,24,1100.0,323.0,0.0,45.83,Apartamento
19829,Quitinete,Copacabana,1,0,0,22,1500.0,286.0,200.0,68.18,Apartamento
19830,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,29.63,Apartamento

In [99]:
df.head(7)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
0,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0,53.33,Apartamento
1,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,0.0,16.67,Apartamento
2,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0,26.00,Apartamento
3,Apartamento,Grajaú,2,1,0,70,1500.0,642.0,74.0,21.43,Apartamento
4,Apartamento,Lins de Vasconcelos,3,1,1,90,1500.0,455.0,14.0,16.67,Apartamento
5,Apartamento,Copacabana,1,0,1,40,2000.0,561.0,50.0,50.00,Apartamento
6,Apartamento,Freguesia (Jacarepaguá),3,0,0,54,950.0,300.0,28.0,17.59,Apartamento

In [98]:
df.tail()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo Agregado
19826,Quitinete,Glória,1,0,0,10,400.0,107.0,10.0,40.00,Apartamento
19827,Quitinete,Flamengo,1,0,0,23,900.0,605.0,0.0,39.13,Apartamento
19828,Quitinete,Centro,1,0,0,24,1100.0,323.0,0.0,45.83,Apartamento
19829,Quitinete,Copacabana,1,0,0,22,1500.0,286.0,200.0,68.18,Apartamento
19830,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0,29.63,Apartamento

In [101]:
!pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.0.7-py2.py3-none-any.whl (243 kB)
     |████████████████████████████████| 243 kB 4.0 MB/s eta 0:00:01
Collecting et-xmlfile
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.0.7

In [102]:
pd.read_excel('../datasets/aluguel.xlsx')

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

In [103]:
pd.read_json('../datasets/aluguel.json')

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

In [4]:
!pip install lxml

Requirement already satisfied: lxml in /home/walisson/.local/lib/python3.8/site-packages (4.6.3)

In [5]:
!pip install bs4

Collecting bs4
  Downloading bs4-0.0.1.tar.gz (1.1 kB)
Collecting beautifulsoup4
  Downloading beautifulsoup4-4.9.3-py3-none-any.whl (115 kB)
     |████████████████████████████████| 115 kB 3.5 MB/s eta 0:00:01
Collecting soupsieve>1.2; python_version >= "3.0"
  Downloading soupsieve-2.2.1-py3-none-any.whl (33 kB)
Building wheels for collected packages: bs4
  Building wheel for bs4 (setup.py) ... done
  Created wheel for bs4: filename=bs4-0.0.1-py3-none-any.whl size=1272 sha256=7dab6b9591aa29d073ea1471199690a62bcaa899bd4ecaeb269dfaf0904adf91
  Stored in directory: /home/walisson/.cache/pip/wheels/75/78/21/68b124549c9bdc94f822c02fb9aa3578a669843f9767776bca
Successfully built bs4
Installing collected packages: soupsieve, beautifulsoup4, bs4
Successfully installed beautifulsoup4-4.9.3 bs4-0.0.1 soupsieve-2.2.1

In [5]:
lista_tabelas = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [6]:
lista_tabelas[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [8]:
len(lista_tabelas)

1

In [9]:
pd.read_html('https://g1.globo.com/bemestar/coronavirus/noticia/2020/05/26/casos-de-coronavirus-e-numero-de-mortes-no-brasil-em-26-de-maio.ghtml')

[                      0             1                   2
 0                Estado  Nº de testes  Data de divulgação
 1                  Acre        11.119                25/5
 2               Alagoas         2.594                27/4
 3                 Amapá        12.165                25/5
 4              Amazonas         6.183                27/4
 5                 Bahia        39.949                21/5
 6                 Ceará        90.476                26/5
 7      Distrito Federal        31.265                28/4
 8        Espírito Santo        39.612                26/5
 9                 Goiás        10.352                27/4
 10             Maranhão        43.697                26/5
 11          Mato Grosso         5.804                26/5
 12   Mato Grosso do Sul         7.663                25/5
 13         Minas Gerais        20.254                26/5
 14                 Pará        25.579                26/5
 15              Paraíba        32.702                26/5
 16               Paraná        26.063                25/5
 17           Pernambuco        46.307                25/5
 18                Piauí        38.583                25/5
 19  Rio Grande do Norte        16.121                26/5
 20    Rio Grande do Sul        12.508                26/5
 21             Rondônia        12.966                26/5
 22              Roraima           718                23/4
 23       Santa Catarina        26.000                25/5
 24            São Paulo        35.600                22/4
 25              Sergipe        15.438                25/5
 26            Tocantins         7.095                25/5
 27                Total       616.813                 NaN,
                       0                            1                   2
 0               Estados  Nº de pacientes recuperados  Data de divulgação
 1                  Acre                        1.574                25/5
 2               Alagoas                        3.653                25/5
 3                 Amapá                        2.700                26/5
 4              Amazonas                       24.112                25/5
 5                 Bahia                        4.680                26/5
 6                 Ceará                       23.299                26/5
 7      Distrito Federal                        3.962                26/5
 8        Espírito Santo                        5.761                26/5
 9              Maranhão                        6.664                26/5
 10          Mato Grosso                          499                26/5
 11   Mato Grosso do Sul                          374                26/5
 12         Minas Gerais                        3.655                26/5
 13                 Pará                       19.317                26/5
 14              Paraíba                        2.225                26/5
 15               Paraná                        1.705                25/5
 16           Pernambuco                        6.694                25/5
 17                Piauí                        32282                25/5
 18       Rio de Janeiro                    31.687934                26/5
 19  Rio Grande do Norte                        1.410                25/5
 20    Rio Grande do Sul                        5.012                26/5
 21             Rondônia                        1.147                26/5
 22              Roraima                          712                25/5
 23       Santa Catarina                        4.101                26/5
 24              Sergipe                        2.209                25/5
 25            Tocantins                          865                26/5
 26                Total                      158.873                 NaN]

### Principais métodos e atributos

- `index`
- `columns`
- `values`
- `shape`
- `dtypes`
- `head()`
- `tail()`
- `describe()`
- `info()`
- `min()`, `max()`, `sum()`...
- `rename()`
- `duplicated()`
- `drop_duplicates()`

### Agrupamento e Ordenação de Dados

### Transformação de Dados

#### `map`

#### `apply`

1. Utilizando uma função pronta
2. Criando uma função própria
3. Utilizando uma função lambda

#### `get_dummies`